#include <stdio.h>
#include <unistd.h>
#include <sys/shm.h>
//如果在堆里的内存，不释放，当进程结束的时候，进程的4G空间全部都会回收，所以堆内存自然也会被
//回收，但是共享内存不是进程级的，如果是进程级的资源，当进程结束的时候，总会被回收。
int main(){
    printf("创建共享内存...\n");
    key_t key = ftok(".",100);
    if(key == -1){
        perror("ftok");
        return -1;
    }
    int shmid = shmget(key,4096,0644 | IPC_CREAT | IPC_EXCL);
    if(shmid == -1){
        perror("shmget");
        return -1;
    }
    printf("加载共享内存...\n");
    void* shmaddr = shmat(shmid,NULL,0);
    if(shmaddr == (void*)-1){
        perror("shmat");
        return -1;
    }
    printf("写入共享内存...\n");
    sprintf(shmaddr,"我是%u进程写入的数据.",getpid());
    printf("按<回车>卸载共享内存(0x%08x/%d)...",key,shmid);
    getchar();
    //但是如果既不卸载，也不销毁,创建者进程结束的时候，有些linux系统依然会帮你释放共享内存。
    //zn@zn-OptiPlex-9010:~/demo/071616$ ipcrm -m 10649647(删除shmid为10649647的共享内存)
    if(shmdt(shmaddr) == -1){
        perror("shmdt");
        return -1;
    }
    printf("按<回车>销毁共享内存(0x%08x/%d)...",key,shmid);
    getchar();
    //如果不销毁共享内存的话，如果共享内存的引用计数为0，并且创建进程也结束的时候，
    //系统会帮你把没有释放的共享内存给释放掉。但是这种机制不是所有的系统都有的。
    //现在使用的系统就没有这种机制，进程已死，但是共享内存依然存在
#if 0
    zn@zn-OptiPlex-9010:~/demo/071616$ gcc wshm.c -o wshm
    zn@zn-OptiPlex-9010:~/demo/071616$ ./wshm
    创建共享内存...
    加载共享内存...
    写入共享内存...
    按<回车>卸载共享内存(0x64062575/10649647)...
    按<回车>销毁共享内存(0x64062575/10649647)...
    大功告成!
    zn@zn-OptiPlex-9010:~/demo/071616$ ./rshm
    获取共享内存...
    加载共享内存...
    读取共享内存...
    共享内存(0x64062575/10649647):我是32161进程写入的数据.
    卸载共享内存...
    大功告成!
      zn@zn-OptiPlex-9010:~/demo/071616$ ipcs -m| grep "0x64062575"
      0x64062575 10649647   zn         644        4096       0
#endif
    if(shmctl(shmid,IPC_RMID,NULL) == -1){
        perror("shmctl");
        return -1;
    }
    printf("大功告成!\n");

    return 0;
}
#if 0
zn@zn-OptiPlex-9010:~/demo/071616$ gcc wshm.c -o wshm
zn@zn-OptiPlex-9010:~/demo/071616$ gcc rshm.c -o rshm
zn@zn-OptiPlex-9010:~/demo/071616$ ./wshm
创建共享内存...
加载共享内存...
写入共享内存...
按<回车>卸载共享内存(0x64062575/10321967)...

zn@zn-OptiPlex-9010:~/demo/071616$ ipcs -m

------ Shared Memory Segments --------
key        shmid      owner      perms      bytes      nattch     status
0x00000000 5767168    zn         700        184408     2          dest
0x00000000 425985     zn         600        524288     2          dest
0x00000000 622594     zn         600        524288     2          dest
0x00000000 655363     zn         600        16777216   2
0x00000000 983044     zn         600        33554432   2          dest
0x00000000 917509     zn         600        524288     2          dest
0x00000000 1081350    zn         600        524288     2          dest
0x51020012 1343495    zn         600        1024       1
0x00000000 4325384    zn         600        524288     2          dest
0x00000000 1540105    zn         600        393216     2          dest
0x00000000 4128778    zn         600        393216     2          dest
0x00000000 1605643    zn         600        3811824    2          dest
0x00000000 1638412    zn         600        393216     2          dest
0x00000000 4554765    zn         600        2097152    2          dest
0x00000000 1769486    zn         600        524288     2          dest
0x00000000 1867791    zn         700        3811824    2          dest
0x00000000 1900560    zn         600        393216     2          dest
0x00000000 1933329    zn         600        524288     2          dest
0x00000000 1966098    zn         700        720000     2          dest
0x00000000 1998867    zn         700        720000     2          dest
0x00000000 2031636    zn         700        720000     2          dest
0x00000000 2064405    zn         700        720000     2          dest
0x00000000 2097174    zn         700        720000     2          dest
0x00000000 2129943    zn         700        720000     2          dest
0x00000000 2162712    zn         700        720000     2          dest
0x00000000 2195481    zn         700        720000     2          dest
0x00000000 2228250    zn         700        720000     2          dest
0x00000000 2261019    zn         700        720000     2          dest
0x00000000 2293788    zn         700        720000     2          dest
0x00000000 2326557    zn         700        720000     2          dest
0x00000000 2359326    zn         700        720000     2          dest
0x00000000 2392095    zn         700        720000     2          dest
0x00000000 2424864    zn         700        720000     2          dest
0x00000000 2457633    zn         700        720000     2          dest
0x00000000 2490402    zn         700        720000     2          dest
0x00000000 2523171    zn         700        720000     2          dest
0x00000000 2555940    zn         700        720000     2          dest
0x00000000 2588709    zn         700        720000     2          dest
0x00000000 2621478    zn         700        720000     2          dest
0x00000000 2654247    zn         700        720000     2          dest
0x00000000 2818088    zn         700        28200      2          dest
0x00000000 3801129    zn         600        393216     2          dest
0x00000000 2785322    zn         700        3344       2          dest
0x00000000 4096043    zn         600        2097152    2          dest
0x00000000 3932204    zn         600        1048576    2          dest
0x00000000 4161581    zn         600        1048576    2          dest
0x00000000 4227118    zn         600        393216     2          dest
0x64062575 10321967   zn         644        4096       1
0x00000000 4489264    zn         600        393216     2          dest
0x00000000 4620337    zn         600        729764     2          dest
0x00000000 7536690    zn         600        719328     2          dest

zn@zn-OptiPlex-9010:~/demo/071616$ ./rshm
获取共享内存...
加载共享内存...
读取共享内存...
共享内存(0x64062575/10321967):我是28919进程写入的数据.
卸载共享内存...
大功告成!
zn@zn-OptiPlex-9010:~/demo/071616$ ps -eaf | grep wshm
zn       28919 28217  0 13:42 pts/0    00:00:00 ./wshm
zn       30132 28832  0 13:46 pts/11   00:00:00 grep --color=auto wshm

  zn@zn-OptiPlex-9010:~/demo/071616$ ./wshm
  创建共享内存...
  加载共享内存...
  写入共享内存...
  按<回车>卸载共享内存(0x64062575/10321967)...
  按<回车>销毁共享内存(0x64062575/10321967)...

  zn@zn-OptiPlex-9010:~/demo/071616$ ./rshm（虽然内存被卸载了，但是只要不被销毁，就可以读到数据）
  获取共享内存...
  加载共享内存...
  读取共享内存...
  共享内存(0x64062575/10321967):我是28919进程写入的数据.
  卸载共享内存...
  大功告成!
  zn@zn-OptiPlex-9010:~/demo/071616$ ./wshm
  创建共享内存...
  加载共享内存...
  写入共享内存...
  按<回车>卸载共享内存(0x64062575/10321967)...
  按<回车>销毁共享内存(0x64062575/10321967)...
  大功告成!
  zn@zn-OptiPlex-9010:~/demo/071616$ ./rshm
  获取共享内存...
  shmget: No such file or directory
#endif

